20251212T232903--kdoc-503-linuxカーネルはboot配下にあるvmlinuzファイルである__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-20T17:30:57Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 503: Linuxカーネルは/boot配下にあるvmlinuzファイルである</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 503: Linuxカーネルは/boot配下にあるvmlinuzファイルである</h1>
<div id="outline-container-org1f1799b" class="outline-2">
<h2 id="org1f1799b"><a href="#org1f1799b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1f1799b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-12-16 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-12-16 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org606d644" class="outline-2">
<h2 id="org606d644"><a href="#org606d644">概要</a></h2>
<div class="outline-text-2" id="text-org606d644">
<p>
Linuxカーネルは <code>/boot</code> 配下にある <code>vmlinuz</code> ファイルである、といえる。カーネルは <code>gzip</code> で圧縮されているので <code>z</code> がついている。
</p>

<p>
手元の環境で試してみると確かに <code>vmlinuz</code> が存在する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>確かめる</label><pre class="src src-shell">ls /boot -al
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">total 95208
drwxr-xr-x  4 root root     4096 Feb 11  2025 .
drwxr-xr-x 24 root root     4096 Oct  5 22:04 ..
-rw-r--r--  1 root root   287413 Dec  1  2024 config-6.8.0-51-generic
drwx------  3 root root     4096 Jan  1  1970 efi
drwxr-xr-x  5 root root     4096 Feb 11  2025 grub
lrwxrwxrwx  1 root root       27 Feb 11  2025 initrd.img -&gt; initrd.img-6.8.0-51-generic
-rw-r--r--  1 root root 73134942 Feb 11  2025 initrd.img-6.8.0-51-generic
lrwxrwxrwx  1 root root       27 Feb 11  2025 initrd.img.old -&gt; initrd.img-6.8.0-51-generic
-rw-------  1 root root  9072978 Dec  1  2024 System.map-6.8.0-51-generic
lrwxrwxrwx  1 root root       24 Feb 11  2025 vmlinuz -&gt; vmlinuz-6.8.0-51-generic
-rw-r--r--  1 root root 14969224 Dec  1  2024 vmlinuz-6.8.0-51-generic
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf04bee5" class="outline-2">
<h2 id="orgf04bee5"><a href="#orgf04bee5">関連</a></h2>
<div class="outline-text-2" id="text-orgf04bee5">
<ul class="org-ul">
<li>引用: <a href="20240105T215847--kdoc-63-『私はどのようにしてlinuxカーネルを学んだか』__book.html#ID-20240105T215847">KDOC 63: 『私はどのようにしてLinuxカーネルを学んだか』</a>から。端的にどこにあたるかが示されていて面白いと感じた</li>
<li>追加調査: <code>/boot</code> ディレクトリのほかのファイルが何か見る</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
